/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec-kiterjesztés";
"06 06 02 82 06 01 0A 01"		= "Telesec-mechanizmus";

"06 07 02 82 06 01 0A 01 00"	= "Telesec-hitelesítés";
"06 08 02 82 06 01 0A 01 00 01"	= "Jelszó-hitelesítés";
"06 08 02 82 06 01 0A 01 00 02" = "Védett jelszó-hitelesítés";
"06 08 02 82 06 01 0A 01 00 03" = "Egyirányú X.509-hitelesítés";
"06 08 02 82 06 01 0A 01 00 04" = "Kétirányú X.509-hitelesítés";
"06 08 02 82 06 01 0A 01 00 05" = "Háromirányú X.509-hitelesítés";
"06 08 02 82 06 01 0A 01 00 06" = "Egyirányú ISO9798-hitelesítés";
"06 08 02 82 06 01 0A 01 00 07" = "Kétirányú ISO9798-hitelesítés";
"06 08 02 82 06 01 0A 01 00 08" = "Telekom-hitelesítés";

"06 07 02 82 06 01 0A 01 01"	= "Telesec-aláírás";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 RSA-val és ISO9697-tel";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 RSA-val és Telesec aláírási szabvánnyal";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 RSA-val és ISO9697-tel";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 RSA-val és Telesec aláírási szabvánnyal";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-106 RSA-val és Telekom aláírási szabvánnyal";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA aláírás";

"06 07 02 82 06 01 0A 01 02"	= "Telesec-titkosítás";
"06 08 02 82 06 01 0A 01 02 00"	= "semmi";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Bíbor";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Egyirányú funkció";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash blokktitkosító használatával";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "FEC-funkció";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec-modul";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmusok";
"06 07 02 82 06 01 0A 02 01"	= "Attribútumtípusok";
"06 07 02 82 06 01 0A 02 02"	= "Tanúsítványtípusok";
"06 07 02 82 06 01 0A 02 03"	= "Üzenettípusok";
"06 07 02 82 06 01 0A 02 04"	= "PL-protokoll";
"06 07 02 82 06 01 0A 02 05"	= "SME és SME-komponensek";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Hasznos definíciók";
"06 07 02 82 06 01 0A 02 08"	= "STE-fájlok";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Elektronikus megrendelés";
"06 07 02 82 06 01 0A 02 0B"	= "Telesec TTP aszimmetrikus alkalmazás";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec TTP alapalkalmazás";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP-üzenetek";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec TTP időpecsét-alkalmazás";

"06 06 02 82 06 01 0A 03"		= "Objektumosztály";
"06 07 02 82 06 01 0A 03 00"	= "Telesec egyéb név";
"06 07 02 82 06 01 0A 03 01"	= "Könyvtár";
"06 07 02 82 06 01 0A 03 02"	= "Könyvtártípus";
"06 07 02 82 06 01 0A 03 03"	= "Könyvtárcsoport";
"06 07 02 82 06 01 0A 03 04"	= "Könyvtárfelhasználó";
"06 07 02 82 06 01 0A 03 05"	= "Szimmetrikus kulcsbejegyzés";

"06 06 02 82 06 01 0A 04"		= "Csomag";
"06 06 02 82 06 01 0A 05"		= "Paraméter";
"06 06 02 82 06 01 0A 06"		= "Névkötés";
"06 06 02 82 06 01 0A 07"		= "Attribútum";
"06 07 02 82 06 01 0A 07 00"	= "Alkalmazáscsoport azonosító";
"06 07 02 82 06 01 0A 07 01"	= "Tanúsítványtípus";
"06 07 02 82 06 01 0A 07 02"	= "Telesec-tanúsítvány";
"06 07 02 82 06 01 0A 07 03"	= "Tanúsítványszám";
"06 07 02 82 06 01 0A 07 04"	= "Tanúsítvány-visszavonási lista";
"06 07 02 82 06 01 0A 07 05"	= "Létrehozási dátum";
"06 07 02 82 06 01 0A 07 06"	= "Kibocsátó";
"06 07 02 82 06 01 0A 07 07"	= "Névadó központ";
"06 07 02 82 06 01 0A 07 08"	= "Nyilvános kulcs könyvtár";
"06 07 02 82 06 01 0A 07 09"	= "Biztonsági domén";
"06 07 02 82 06 01 0A 07 0A"	= "Alany";
"06 07 02 82 06 01 0A 07 0B"	= "Visszavonás ideje";
"06 07 02 82 06 01 0A 07 0C"	= "Felhasználói csoport hivatkozás";
"06 07 02 82 06 01 0A 07 0D"	= "Érvényesség";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Biztonsági üzenetkörnyezet";
"06 07 02 82 06 01 0A 07 10"	= "Névtelenített nyilvános kulcs könyvtár";
"06 07 02 82 06 01 0A 07 11"	= "Telesec-utónév";
"06 07 02 82 06 01 0A 07 12"	= "Névhozzáadások";
"06 07 02 82 06 01 0A 07 13"	= "Telesec-irányítószám";
"06 07 02 82 06 01 0A 07 14"	= "Név-megkülönböztető";
"06 07 02 82 06 01 0A 07 15"	= "Tanúsítványlista";
"06 07 02 82 06 01 0A 07 16"	= "Teletrust tanúsítványlista";
"06 07 02 82 06 01 0A 07 17"	= "X.509-tanúsítványlista";
"06 07 02 82 06 01 0A 07 18"	= "Kibocsátás ideje";
"06 07 02 82 06 01 0A 07 19"	= "Fizikai kártya száma";
"06 07 02 82 06 01 0A 07 1A"	= "Fájltípus";
"06 07 02 82 06 01 0A 07 1B"	= "A Ctl fájl egy archívum";
"06 07 02 82 06 01 0A 07 1C"	= "E-mail cím";
"06 07 02 82 06 01 0A 07 1D"	= "Tanúsítványsablon-lista";
"06 07 02 82 06 01 0A 07 1E"	= "Könyvtárnév";
"06 07 02 82 06 01 0A 07 1F"	= "Könyvtártípusnév";
"06 07 02 82 06 01 0A 07 20"	= "Könyvtárcsoportnév";
"06 07 02 82 06 01 0A 07 21"	= "Könyvtárfelhasználó-név";
"06 07 02 82 06 01 0A 07 22"	= "Visszavonási megjelölés";
"06 07 02 82 06 01 0A 07 23"	= "Szimmetrikus kulcsbejegyzésnév";
"06 07 02 82 06 01 0A 07 24"	= "GL-szám";
"06 07 02 82 06 01 0A 07 25"	= "GO-szám";
"06 07 02 82 06 01 0A 07 26"	= "G-kulcsadat";
"06 07 02 82 06 01 0A 07 27"	= "Z-kulcsadat";
"06 07 02 82 06 01 0A 07 28"	= "KT-kulcsadat";
"06 07 02 82 06 01 0A 07 2A"	= "KT-kulcsszám";
"06 07 02 82 06 01 0A 07 33"	= "Visszavonás létrehozási ideje";
"06 07 02 82 06 01 0A 07 34"	= "Felelősségszöveg";

"06 06 02 82 06 01 0A 08"		= "Attribútumcsoport";
"06 06 02 82 06 01 0A 09"		= "Művelet";
"06 06 02 82 06 01 0A 0A"		= "Értesítés";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Biztonsági alkalmazás";

"06 06 02 82 06 01 0A 0C"		= "Tanúsítvány és CRL kiterjesztés definíciók";

"06 07 02 82 06 01 0A 0C 00"	= "Tanúsítvány kiterjesztés felelősség korlátozási kiterjesztés";
"06 07 02 82 06 01 0A 0C 01"	= "Telesec-tanúsítvány ID-kiterjesztés";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec szabályzatazonosító";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec szabályzatminősítő-azonosító";
"06 07 02 82 06 01 0A 0C 04"	= "Telesec CRL szűrt kiterjesztés";
"06 07 02 82 06 01 0A 0C 05"	= "Telesec CRL-szűrőkiterjesztés";
"06 07 02 82 06 01 0A 0C 06"	= "Telesec névadó központ kiterjesztés";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "Felhasználói ID";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822 postafiók";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Doménkomponens";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Ausztrál üzleti szám";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Certificates Australia szabályzatazonosító";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet személyes";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet üzleti";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet jogi";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet szabályzatazonosító";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Szimmetrikus titkosító algoritmus";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "SEIS magas biztosítású szabályzatazonosító";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK szabályzatazonosító";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT személyi azonosító";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57 modul";
"06 07 2A 86 48 CE 38 01 01"	= "X9F1 tanúsítványkezelés";
"06 06 2A 86 48 CE 38 02"		= "Tartási utasítás";
"06 07 2A 86 48 CE 38 02 01"	= "Tartási utasítás-Nincs";
"06 07 2A 86 48 CE 38 02 02"	= "Kibocsátó hívása";
"06 07 2A 86 48 CE 38 02 03"	= "Elutasítás";
"06 07 2A 86 48 CE 38 02 04"	= "Felszedési token";
"06 06 2A 86 48 CE 38 03"		= "Attribútum";
"06 06 2A 86 48 CE 38 03 01"	= "Ellenjegyzés";
"06 06 2A 86 48 CE 38 03 02"	= "Attribútum tanúsítvány";
"06 06 2A 86 48 CE 38 04"		= "Algoritmus";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA egyezési";
"06 07 2A 86 48 CE 38 04 03"	= "DSA SHA-1 elemmel";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ANSI X9.62 mezőtípus";
"06 07 2A 86 48 CE 3D 01 01"	= "Elsődleges mező";
"06 07 2A 86 48 CE 3D 01 02"	= "Characteristic-Two Field";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Characteristic-Two Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Nullabázis";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Trinomiális bázis";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Pentanomiális bázis";
"06 06 2A 86 48 CE 3D 02"		= "Nyilvános kulcs típusa";
"06 07 2A 86 48 CE 3D 02 01"	= "Elliptikus görbe nyilvános kulcs";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ANSI X9.42 mezőtípus";
"06 07 2A 86 48 CE 3E 01 01"	= "Galois-főmező";
"06 06 2A 86 48 CE 3E 02"		= "Számtípus";
"06 07 2A 86 48 CE 3E 02 01"	= "Diffie-Hellman nyilvános kulcs";
"06 06 2A 86 48 CE 3E 03"		= "Séma";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman statikus";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman röpke idejű";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman hibrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman hibrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Entrust verzió infó";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE MD5-tel és CAST5-CBC-vel";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "Jelszóalapú MAC";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Entrust felhasználó";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Entrust CA infó";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Attribútum tanúsítvány";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA-titkosítás";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 RSA titkosítással";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 RSA titkosítással";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 RSA titkosítással";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 RSA titkosítással";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP titkosítás (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP titkosítás";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP címke megadva";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "RSA-PSS aláírásséma";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 RSA titkosítással";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 RSA titkosítással";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 RSA titkosítással";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 RSA titkosítással";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE RSA titkosítás";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Diffie-Hellman kulcs egyezmény";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE MD2-vel és DES-CBC-vel";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE MD5-tel és DES-CBC-vel";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE MD2-vel és RC2-CBC-vel";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE MD5-tel és RC2-CBC-vel";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE MD5-tel és XOR-ral";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE SHA-val és DES-CBC-vel";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Adatok";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Aláírt adatok";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Borítékolt adatok";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Aláírt és borítékolt adatok";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Kivonatolt adatok";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Titkosított adatok";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Attribútumos adatok";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Titkosított privát kulcs infó";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "E-mail cím";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Struktúrálatlan név";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Tartalomtípus";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Üzenetkivonat";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Aláírási idő";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Ellenjegyzés";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Kihívás jelszó";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Struktúrálatlan cím";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Kiterjesztett tanúsítványattribútumok";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Kibocsátó és sorozatszám";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Jelszóellenőrzés";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Nyilvános kulcs";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Aláíró leírás";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Kiterjesztéskérés";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME-képességek";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Preferálj aláírt adatokat";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Egyik titkosítás sem oldható fel";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Nyugtakérés";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Nyugta";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Tartalomtippek";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Levelezési lista kibővítési előzményei";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME-modulok";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Kriptografikus üzenetszintaxis";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Továbbfejlesztett biztonsági szolgáltatások";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME-objektumazonosító";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3 üzenet";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS elektronikus aláírás 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS elektronikus aláírás 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS elektronikus aláírás szabályzat 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS elektronikus aláírás szabályzat 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "S/MIME-tartalomtípusok";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "S/MIME hitelesített attribútumok";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME-algoritmus";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "S/MIME tanúsítványkézbesítés";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "LDAP tanúsítványkézbesítés";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME tanúsítványszabályzat-minősítő";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfApproval";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME tanúsítványtípus azonosító";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Kezdeményező aláírás";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Doménaláírás";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Járulékos attribútumok aláírás";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Aláírás áttekintése";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME-képességek";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Preferálj belső binárist";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Barátságos név (PKCS-12 számára)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Helyi kulcs ID (PKCS-12 számára)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Tanúsítványtípusok (PKCS-12 számára)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509-tanúsítvány (PKCS-12 számára)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "SDSI-tanúsítvány (PKCS-12 számára)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "CRL-típusok (PKCS-12 számára)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509-CRL (PKCS-12 számára)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 személyes információcserélő szintaxis";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12 jelszóalapú titkosítási ID-k";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE SHA-1-gyel és 128-bites RC4-gyel";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE SHA-1-gyel és 40-bites RC4-gyel";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE SHA1-gyel és háromkulcsos tripla DES-CBC-vel";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE SHA1-gyel és kétkulcsos tripla DES-CBC-vel";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE SHA-1-gyel és 128-bites RC2-CBC-vel";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE SHA-1-gyel és 40-bites RC2-CBC-vel";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK ID-k";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8 kulcstakarás";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 csomag ID-k";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12 kulcscsomag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12 tanúsítvány és CRL csomag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 titkos csomag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 biztonságos tartalom ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 takart kulcscsomag ID";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12 tanúsítványcsomag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 X.509 tanúsítvány és CRL csomag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12 SDSI tanúsítványcsomag ID";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12 jelszóalapú titkosítási ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE SHA-1-gyel és 128-bites RC4-gyel";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE SHA-1-gyel és 40-bites RC4-gyel";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE SHA-1-gyel és tripla DES-CBC-vel";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE SHA-1-gyel és 128-bites RC2-CBC-vel";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE SHA-1-gyel és 40-bites RC2-CBC-vel";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE SHA-1-gyel és RC4-gyel";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE SHA-1-gyel és RC2-CBC-vel";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 borítékoló ID-k";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "PKCS-12 RSA titkosítás 128-bites RC4-gyel";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "PKCS-12 RSA titkosítás 40-bites RC4-gyel";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "PKCS-12 RSA titkosítás 40-bites tripla DES-sel";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12 aláírás ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "PKCS-12 RSA aláírás SHA-1 kivonattal";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 verzió 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 csomag ID-k";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12 kulcscsomag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 takart kulcscsomag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12 tanúsítványcsomag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12 CRL-csomag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 titkos csomag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 biztonságos tartalom csomag";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15 modulok";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15 attribútumok";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15 tartalomtípus";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15 tartalom";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI kivonatalgoritmus";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC SHA-1 elemmel";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI titkosítási algoritmus";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 MAC-kel";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC ISO Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identrus ismeretlen szabályzatazonosító";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "Kerberos v5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT felhasználó-felhasználó Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server objektumosztály";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Webhelycímző";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Osztályséma";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Attribútumséma";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Postafiókügynök";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Postafiók";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Konténer";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Postai címzett";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Kézbesítési mechanizmus";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoft fájlformátumok";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Hitelesítő kód";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "SPC közvetlen adatkontextus";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC-ügynökség infó";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "SPC-közleménytípus";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC opus infó";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC tanúsítvány-kiterjesztések";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC PE képadatok";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPCSPC-link (1-es típus)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Egyéni kódaláíró";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Kereskedelmi kódaláíró";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPCSPC-link (2-es típus)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "SPC minimális kritérium";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "SPC pénzügyi kritérium";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPCSPC-link (3-as típus)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "NTLM biztonsági támogatás szolgáltató";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Időpecsét-ellenjegyzés";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Tanúsítvány megbízhatósági lista";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Rendezett CTL-kiterjesztés";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Következő frissítési helyzet";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Továbbfejlesztett kulcshasználat";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Tanúsítvány megbízhatósági listaaláíró";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Időpecsét-aláíró";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Szerver kapuzott crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Sorszámozott titkosítás";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Titkosított fájlrendszerek";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Titkosított fájlrendszerek visszaállítása";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Windows hardver kompatibilis";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5 aláíró";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Windows hardver OEM-aláíró";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Beágyazott NT-aláíró";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Megbízható gyökérlista-aláíró";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Minősített szub-ordináció";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Kulcsvisszaállítás";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Dokumentum-aláíró";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Attribútum objektum azonosítók";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Igen/nem megbízhatósági attribútum";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft zenei DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM-egyéniesítés";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft licencia";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft licenciaszerver";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10 objektumazonosítók";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Megújítási tanúsítvány";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Jelentkezési név/értékpár";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Jelentkezési CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "OS-verzió";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12 attribútumok";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Helyi gép kulcskészlet";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft jelentkezési infrastruktúra";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Önfeliratkozó CTL használat";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Jelentkezési ügynök";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Jelentkezési ügynök";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Smartcard bejelentkezés";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "NT elöljárónév";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft tanúsítványszerver-infrastruktúra";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA megújító verzió";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "CAPICOM-verzió";
"06 09 2B 06 01 04 01 82 37 58 02"			= "CAPICOM-attribútum";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Dokumentumnév";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Dokumentum-leírás";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Titkosított adatok";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Titkosított tartalom";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT szabályzatazonosító";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL szabályzatazonosító";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA szabályzatazonosító";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal SHA-1 elemmel";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal RIPEMD-160 elemmel";
"06 09 2B 06 01 04 01 97 55 03 01"			= "cryptlib attribútumok";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "cryptlib jelenlét-ellenőrzés";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP-válasz RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP-válasz RTCS kiterjesztett";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "CRL kiterjesztett ok";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Kulcsfunkciók";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI Boot";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib tartalom";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "cryptlib konfigurációs adatok";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "cryptlib felhasználói index";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "cryptlib felhasználói infó";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY szabályzatazonosító";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Időbizonyíték";
"06 08 2B 06 01 04 01 AA 60 01"		= "Időaláírási rendszer";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Időaláírási rendszer 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Időaláírási rendszer 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Időaláírási rendszer 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Másodlagos gyakorlatok";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Orvosi azonosítók";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos hitelesítési adatok";
"06 07 2B 06 01 05 02 03 02"        = "Kerberos Diffie-Hellman kulcsadatok";
"06 07 2B 06 01 05 02 03 03"        = "Kerberos válaszkulcsadatok";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos klienshitelesítés";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos kulcselosztó központ (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Egyszerű nyilvános kulcs mechanizmus (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Nyilvános kulcs infrastruktúra";

"06 07 2B 06 01 05 05 07 01"		= "PKIX privát tanúsítvány-kiterjesztések";
"06 08 2B 06 01 05 05 07 01 01"		= "Tanúsítványkiadó központ információs hozzáférés";
"06 08 2B 06 01 05 05 07 01 02"		= "Biometrikus információ";
"06 08 2B 06 01 05 05 07 01 03"		= "Minősített tanúsítványközlemények";
"06 08 2B 06 01 05 05 07 01 04"		= "Attribútum tanúsítvány vizsgáló azonosság";
"06 08 2B 06 01 05 05 07 01 05"		= "Attribútum tanúsítvány célzás";
"06 08 2B 06 01 05 05 07 01 06"		= "Attribútum tanúsítványkiadó központ vezérlők";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP IP címblokk";
"06 08 2B 06 01 05 05 07 01 08"		= "SBGP önálló rendszerazonosító";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP routerazonosító";
"06 08 2B 06 01 05 05 07 01 0A"		= "Attribútum tanúsítvány proxyzás";
"06 08 2B 06 01 05 05 07 01 0B"		= "Alany információs elérése";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotype";

"06 07 2B 06 01 05 05 07 02"		= "Szabályzatminősítő típusok";
"06 08 2B 06 01 05 05 07 02 01"		= "Tanúsítvány gyakorlati állítás";
"06 08 2B 06 01 05 05 07 02 02"		= "Felhasználói jegyzet";
"06 08 2B 06 01 05 05 07 02 03"		= "Szöveges jegyzet";

"06 07 2B 06 01 05 05 07 03"		= "Kulcs célja";
"06 08 2B 06 01 05 05 07 03 01"		= "Szerverhitelesítés";
"06 08 2B 06 01 05 05 07 03 02"		= "Klienshitelesítés";
"06 08 2B 06 01 05 05 07 03 03"		= "Kódaláíró";
"06 08 2B 06 01 05 05 07 03 04"		= "E-mail védelem";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC-végrendszer";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC-alagút";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC-felhasználó";
"06 08 2B 06 01 05 05 07 03 08"		= "Időpecsételő";
"06 08 2B 06 01 05 05 07 03 09"		= "OCSP aláíró";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP AA szerverhitelesítés";

"06 07 2B 06 01 05 05 07 04"		= "CMP Information Types";
"06 08 2B 06 01 05 05 07 04 01"		= "CA protokoll titkosítási tanúsítvány";
"06 08 2B 06 01 05 05 07 04 02"		= "Aláíró kulcspártípusok";
"06 08 2B 06 01 05 05 07 04 03"		= "Titkosítási kulcspártípusok";
"06 08 2B 06 01 05 05 07 04 04"		= "Preferált szimmetrikus algoritmus";
"06 08 2B 06 01 05 05 07 04 05"		= "CA kulcsfrissítési infó";
"06 08 2B 06 01 05 05 07 04 06"		= "Aktuális CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "Nem támogatott OID-k";
"06 08 2B 06 01 05 05 07 04 08"		= "Előfizetési kérés";
"06 08 2B 06 01 05 05 07 04 09"		= "Előfizetési válasz";
"06 08 2B 06 01 05 05 07 04 0A"		= "Kulcspárparaméter-kérés";
"06 08 2B 06 01 05 05 07 04 0B"		= "Kulcspárparaméter-válasz";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "CRMF-regisztráció";
"06 08 2B 06 01 05 05 07 05 01"		= "Regisztrációvezérlés";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Regisztrációs token";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Hitelesítő";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI publikációs infó";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI archívumopciók";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Régi tanúsítvány ID";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Protokolltitkosító kulcs";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Alternatív tanúsítványsablon";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS-sablon";

"06 08 2B 06 01 05 05 07 05 02"		= "CRMF-regisztrációs infó";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8 párok";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Tanúsítványkérés";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmusok";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Nincs aláírás";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "CMC-vezérlők";

"06 07 2B 06 01 05 05 07 08"		= "Egyéb nevek";
"06 08 2B 06 01 05 05 07 08 01"		= "Személyi adatok";
"06 08 2B 06 01 05 05 07 08 02"		= "Felhasználói csoport";

"06 07 2B 06 01 05 05 07 09"		= "Személyi adatok";
"06 08 2B 06 01 05 05 07 09 01"		= "Születési dátum";
"06 08 2B 06 01 05 05 07 09 02"		= "Születési hely";
"06 08 2B 06 01 05 05 07 09 03"		= "Álnév";
"06 08 2B 06 01 05 05 07 09 04"		= "Nem";
"06 08 2B 06 01 05 05 07 09 05"		= "Állampolgárság országa";
"06 08 2B 06 01 05 05 07 09 06"		= "Lakóhely országa";

"06 07 2B 06 01 05 05 07 0A"		= "Attribútum tanúsítvány";
"06 08 2B 06 01 05 05 07 0A 01"		= "Hitelesítési információ";
"06 08 2B 06 01 05 05 07 0A 02"		= "Hozzáférési identitás";
"06 08 2B 06 01 05 05 07 0A 03"		= "Számlázó identitás";
"06 08 2B 06 01 05 05 07 0A 04"		= "Csoport";
"06 08 2B 06 01 05 05 07 0A 05"		= "Feladat";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Online tanúsítványállapot-protokoll";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP-alapválasz";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP Nonce-kiterjesztés";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP CRL-hivatkozás";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP-válasz";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP nincs visszavonási ellenőrzés";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP-archívumlevágás";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP-szolgáltatáskereső";

"06 08 2B 06 01 05 05 07 30 02"		= "CA kibocsátók";
"06 08 2B 06 01 05 05 07 30 03"		= "Időpecsételő";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE közbenső";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "DEC titkosító algoritmus";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "DEC hash algoritmus";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "DEC aláíró algoritmus";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 RSA-val";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 RSA-val";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 RSA-val";
"06 05 2B 0E 03 02 03"				= "MD5 RSA-val";
"06 05 2B 0E 03 02 04"				= "MD4 RSA titkosítással";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N RSA-val";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA-aláírás";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA SHA elemmel";
"06 05 2B 0E 03 02 0E"				= "MDC2 RSA-aláírással";
"06 05 2B 0E 03 02 0F"				= "SHA RSA-aláírással";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman Common Modulus-szal";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA általános";
"06 05 2B 0E 03 02 15"				= "DSA általános SHA elemmel";
"06 05 2B 0E 03 02 16"				= "RSA-kulcstovábbítás";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 RSA-aláírással";
"06 05 2B 0E 03 02 19"				= "MD5 RSA-aláírással";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA SHA-1 elemmel";
"06 05 2B 0E 03 02 1C"				= "DSA általános SHA-1 elemmel";
"06 05 2B 0E 03 02 1D"				= "SHA-1 RSA titkosítással";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 RSA-val";
"06 06 2B 0E 07 02 03 02"			= "MD2 ElGamal-lal";

/* Teletrust */

"06 03 2B 24 01"					= "Dokumentum";
"06 04 2B 24 01 01"					= "Végső verzió";
"06 04 2B 24 01 02"					= "Vázlat";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritmus";
"06 04 2B 24 03 01"					= "Titkosítási algoritmus";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA-titkosítás";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Hash algoritmus";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 egyszeres hossz";
"06 05 2B 24 03 02 05"				= "MDC2 kétszeres hossz";
"06 04 2B 24 03 03"					= "Aláíró algoritmus";
"06 05 2B 24 03 03 01"				= "RSA-aláírás";

"06 06 2B 24 03 03 01 01"			= "RSA-aláírás SHA-1 elemmel";
"06 09 2B 24 03 03 01 01 84 00 02"	= "RSA-aláírás SHA-1 512/L2 elemmel";
"06 09 2B 24 03 03 01 01 85 00 02"	= "RSA-aláírás SHA-1 640/L2 elemmel";
"06 09 2B 24 03 03 01 01 86 00 02"	= "RSA-aláírás SHA-1 768/L2 elemmel";
"06 09 2B 24 03 03 01 01 87 00 02"	= "RSA-aláírás SHA-1 896/L2 elemmel";
"06 09 2B 24 03 03 01 01 88 00 02"	= "RSA-aláírás SHA-1 1024/L2 elemmel";
"06 09 2B 24 03 03 01 01 84 00 03"	= "RSA-aláírás SHA-1 512/L3 elemmel";
"06 09 2B 24 03 03 01 01 85 00 03"	= "RSA-aláírás SHA-1 640/L3 elemmel";
"06 09 2B 24 03 03 01 01 86 00 03"	= "RSA-aláírás SHA-1 768/L3 elemmel";
"06 09 2B 24 03 03 01 01 87 00 03"	= "RSA-aláírás SHA-1 896/L3 elemmel";
"06 09 2B 24 03 03 01 01 88 00 03"	= "RSA-aláírás SHA-1 1024/L3 elemmel";
"06 09 2B 24 03 03 01 01 84 00 05"	= "RSA-aláírás SHA-1 512/L5 elemmel";
"06 09 2B 24 03 03 01 01 85 00 05"	= "RSA-aláírás SHA-1 640/L5 elemmel";
"06 09 2B 24 03 03 01 01 86 00 05"	= "RSA-aláírás SHA-1 768/L5 elemmel";
"06 09 2B 24 03 03 01 01 87 00 05"	= "RSA-aláírás SHA-1 896/L5 elemmel";
"06 09 2B 24 03 03 01 01 88 00 05"	= "RSA-aláírás SHA-1 1024/L5 elemmel";
"06 09 2B 24 03 03 01 01 84 00 09"	= "RSA-aláírás SHA-1 512/L9 elemmel";
"06 09 2B 24 03 03 01 01 85 00 09"	= "RSA-aláírás SHA-1 640/L9 elemmel";
"06 09 2B 24 03 03 01 01 86 00 09"	= "RSA-aláírás SHA-1 768/L9 elemmel";
"06 09 2B 24 03 03 01 01 87 00 09"	= "RSA-aláírás SHA-1 896/L9 elemmel";
"06 09 2B 24 03 03 01 01 88 00 09"	= "RSA-aláírás SHA-1 1024/L9 elemmel";
"06 09 2B 24 03 03 01 01 84 00 11"	= "RSA-aláírás SHA-1 512/L11 elemmel";
"06 09 2B 24 03 03 01 01 85 00 11"	= "RSA-aláírás SHA-1 640/L11 elemmel";
"06 09 2B 24 03 03 01 01 86 00 11"	= "RSA-aláírás SHA-1 768/L11 elemmel";
"06 09 2B 24 03 03 01 01 87 00 11"	= "RSA-aláírás SHA-1 896/L11 elemmel";
"06 09 2B 24 03 03 01 01 88 00 11"	= "RSA-aláírás SHA-1 1024/L11 elemmel";

"06 06 2B 24 03 03 01 02"			= "RSA-aláírás RIPEMD-160 elemmel";
"06 09 2B 24 03 03 01 02 84 00 02"	= "RSA-aláírás RIPEMD-160 512/L2 elemmel";
"06 09 2B 24 03 03 01 02 85 00 02"	= "RSA-aláírás RIPEMD-160 640/L2 elemmel";
"06 09 2B 24 03 03 01 02 86 00 02"	= "RSA-aláírás RIPEMD-160 768/L2 elemmel";
"06 09 2B 24 03 03 01 02 87 00 02"	= "RSA-aláírás RIPEMD-160 896/L2 elemmel";
"06 09 2B 24 03 03 01 02 88 00 02"	= "RSA-aláírás RIPEMD-160 1024/L2 elemmel";
"06 09 2B 24 03 03 01 02 84 00 03"	= "RSA-aláírás RIPEMD-160 512/L3 elemmel";
"06 09 2B 24 03 03 01 02 85 00 03"	= "RSA-aláírás RIPEMD-160 640/L3 elemmel";
"06 09 2B 24 03 03 01 02 86 00 03"	= "RSA-aláírás RIPEMD-160 768/L3 elemmel";
"06 09 2B 24 03 03 01 02 87 00 03"	= "RSA-aláírás RIPEMD-160 896/L3 elemmel";
"06 09 2B 24 03 03 01 02 88 00 03"	= "RSA-aláírás RIPEMD-160 1024/L3 elemmel";
"06 09 2B 24 03 03 01 02 84 00 05"	= "RSA-aláírás RIPEMD-160 512/L5 elemmel";
"06 09 2B 24 03 03 01 02 85 00 05"	= "RSA-aláírás RIPEMD-160 640/L5 elemmel";
"06 09 2B 24 03 03 01 02 86 00 05"	= "RSA-aláírás RIPEMD-160 768/L5 elemmel";
"06 09 2B 24 03 03 01 02 87 00 05"	= "RSA-aláírás RIPEMD-160 896/L5 elemmel";
"06 09 2B 24 03 03 01 02 88 00 05"	= "RSA-aláírás RIPEMD-160 1024/L5 elemmel";
"06 09 2B 24 03 03 01 02 84 00 09"	= "RSA-aláírás RIPEMD-160 512/L9 elemmel";
"06 09 2B 24 03 03 01 02 85 00 09"	= "RSA-aláírás RIPEMD-160 640/L9 elemmel";
"06 09 2B 24 03 03 01 02 86 00 09"	= "RSA-aláírás RIPEMD-160 768/L9 elemmel";
"06 09 2B 24 03 03 01 02 87 00 09"	= "RSA-aláírás RIPEMD-160 896/L9 elemmel";
"06 09 2B 24 03 03 01 02 88 00 09"	= "RSA-aláírás RIPEMD-160 1024/L9 elemmel";
"06 09 2B 24 03 03 01 02 84 00 11"	= "RSA-aláírás RIPEMD-160 512/L11 elemmel";
"06 09 2B 24 03 03 01 02 85 00 11"	= "RSA-aláírás RIPEMD-160 640/L11 elemmel";
"06 09 2B 24 03 03 01 02 86 00 11"	= "RSA-aláírás RIPEMD-160 768/L11 elemmel";
"06 09 2B 24 03 03 01 02 87 00 11"	= "RSA-aláírás RIPEMD-160 896/L11 elemmel";
"06 09 2B 24 03 03 01 02 88 00 11"	= "RSA-aláírás RIPEMD-160 1024/L11 elemmel";

"06 06 2B 24 03 03 01 03"			= "RSA-aláírás RIPEMD-128 elemmel";
"06 06 2B 24 03 03 01 04"			= "RSA-aláírás RIPEMD-256 elemmel";

"06 05 2B 24 03 03 02"				= "ECSIE-aláírás";
"06 06 2B 24 03 03 02 01"			= "ECSIE-aláírás SHA-1 elemmel";
"06 06 2B 24 03 03 02 02"			= "ECSIE-aláírás RIPEMD-160 elemmel";
"06 06 2B 24 03 03 02 03"			= "ECSIE-aláírás MD2 elemmel";
"06 06 2B 24 03 03 02 04"			= "ECSIE-aláírás MD5 elemmel";

"06 04 2B 24 03 04"					= "Aláírásséma";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 RED-del";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 RSA-val";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 RND-vel";

"06 03 2B 24 04"					= "Attribútum";
"06 03 2B 24 05"					= "Szabályzat";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "Gyártóspecifikus API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "Funkcionalitás-specifikus API";
"06 03 2B 24 07"					= "Kulcskezelés";
"06 04 2B 24 07 01"					= "Kulcsegyezmény";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Kulcsátvitel";
"06 05 2B 24 07 02 01"				= "ISO9796-2 RSA titkosítással";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform szabályzatazonosító";
"06 05 2B 24 08 02 01"				= "Könyvtárszolgáltatás";

"06 05 2B 24 08 03 01"				= "Tanúsítvány létrehozási dátuma";
"06 05 2B 24 08 03 02"				= "Meghatalmazás";
"06 05 2B 24 08 03 03"				= "Belépés";
"06 05 2B 24 08 03 04"				= "Pénzügyi korlát";
"06 05 2B 24 08 03 05"				= "Nagykorúsági nyilatkozat";
"06 05 2B 24 08 03 06"				= "Integrált áramköri kártya sorozatszám";
"06 05 2B 24 08 03 07"				= "Nyilvános kulcs hivatkozás";
"06 05 2B 24 08 03 08"				= "Korlátozás";
"06 05 2B 24 08 03 09"				= "Beszerzés, ha engedett";
"06 05 2B 24 08 03 0A"				= "Kért tanúsítvány";
"06 05 2B 24 08 03 0B"				= "Névadó központok";
"06 05 2B 24 08 03 0C"				= "Tanúsítvány a könyvtárban ezóta";
"06 05 2B 24 08 03 0D"				= "Tanúsítvány hash";

"06 05 2B 24 08 04 01"				= "Személyi adatok";
"06 05 2B 24 08 04 08"				= "Korlátozás";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA SHA-1 elemmel";
"06 07 2B 24 08 05 01 01 04"		= "RSA RIPEMD-160 elemmel";
"06 07 2B 24 08 05 01 02 01"		= "DSA kiterjesztett";
"06 07 2B 24 08 05 01 02 02"		= "DSA RIPEMD-160 elemmel";

"06 05 2B 24 08 06 01"				= "Tanúsítvány";
"06 05 2B 24 08 06 02"				= "Tanúsítványhivatkozás";
"06 05 2B 24 08 06 03"				= "Attribútum tanúsítvány";
"06 05 2B 24 08 06 04"				= "Attribútum hivatkozás";
"06 05 2B 24 08 06 05"				= "Fájlnév";
"06 05 2B 24 08 06 06"				= "Tárolási idő";
"06 05 2B 24 08 06 07"				= "Fájlméret";
"06 05 2B 24 08 06 08"				= "Helyzet";
"06 05 2B 24 08 06 09"				= "Aláírásszám";
"06 05 2B 24 08 06 0A"				= "Öngenerált";

"06 05 2B 24 08 07 01"				= "Teletrust prezentációs típusok";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Bináris";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Szöveg";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Thawte tanúsítvány-kiterjesztés";
"06 05 2B 65 01 04 01"				= "Erős Extranet";

/* X.520 */

"06 02 55 04"		= "X.520 attribútumtípusok";
"06 03 55 04 00"	= "Objektumosztály";
"06 03 55 04 01"	= "Álruházott bejegyzésnév";
"06 03 55 04 02"	= "Tudásinformáció";
"06 03 55 04 03"	= "Általános név";
"06 03 55 04 04"	= "Családi név";
"06 03 55 04 05"	= "Sorozatszám";
"06 03 55 04 06"	= "Országnév";
"06 03 55 04 07"	= "Helységnév";
"06 04 55 04 07 01"	= "Kollektív helységnév";
"06 03 55 04 08"	= "Állam vagy tartomány neve";
"06 04 55 04 08 01"	= "Kollektív állam vagy tartomány neve";
"06 03 55 04 09"	= "Utcai cím";
"06 04 55 04 09 01"	= "Kollektív lakcím";
"06 03 55 04 0A"	= "Szervezetnév";
"06 04 55 04 0A 01"	= "Kollektív szervezetnév";
"06 03 55 04 0B"	= "Szervezeti egységnév";
"06 04 55 04 0B 01"	= "Kollektív szervezeti egységnév";
"06 03 55 04 0C"	= "Megszólítás";
"06 03 55 04 0D"	= "Leírás";
"06 03 55 04 0E"	= "Keresési útmutató";
"06 03 55 04 0F"	= "Üzleti kategória";
"06 03 55 04 10"	= "Postai cím";
"06 04 55 04 10 01"	= "Kollektív postai cím";
"06 03 55 04 11"	= "Irányítószám";
"06 04 55 04 11 01"	= "Kollektív postai kód";
"06 03 55 04 12"	= "Postafiók";
"06 04 55 04 12 01"	= "Kollektív postafiók";
"06 03 55 04 13"	= "Fizikai kézbesítő osztálynév";
"06 04 55 04 13 01"	= "Kollektív fizikai kézbesítő osztálynév";
"06 03 55 04 14"	= "Telefonszám";
"06 04 55 04 14 01"	= "Kollektív telefonszám";
"06 03 55 04 15"	= "Telexszám";
"06 04 55 04 15 01"	= "Kollektív telexszám";
"06 03 55 04 16"	= "Teletex terminálazonosító";
"06 04 55 04 16 01"	= "Kollektív teletex terminálazonosító";
"06 03 55 04 17"	= "Fax telefonszám";
"06 04 55 04 17 01"	= "Kollektív fax telefonszám";
"06 03 55 04 18"	= "X.121-cím";
"06 03 55 04 19"	= "Nemzetközi ISDN-szám";
"06 04 55 04 19 01"	= "Kollektív nemzetközi ISDN-szám";
"06 03 55 04 1A"	= "Regisztrált cím";
"06 03 55 04 1B"	= "Rendeltetési indikátor";
"06 03 55 04 1C"	= "Preferált kézbesítési mód";
"06 03 55 04 1D"	= "Prezentációs cím";
"06 03 55 04 1E"	= "Támogatott alkalmazáskontextus";
"06 03 55 04 1F"	= "Tag";
"06 03 55 04 20"	= "Tulajdonos";
"06 03 55 04 21"	= "Feladatokkupáns";
"06 03 55 04 22"	= "Lásd még";
"06 03 55 04 23"	= "Felhasználói jelszó";
"06 03 55 04 24"	= "Felhasználói tanúsítvány";
"06 03 55 04 25"	= "CA Tanúsítvány";
"06 03 55 04 26"	= "Hatósági visszavonási lista";
"06 03 55 04 27"	= "Tanúsítvány-visszavonási lista";
"06 03 55 04 28"	= "Kereszttanúsítvány-pár";
"06 03 55 04 29"	= "Név";
"06 03 55 04 2A"	= "Utónév";
"06 03 55 04 2B"	= "Kezdőbetűk";
"06 03 55 04 2C"	= "Generáció minősítő";
"06 03 55 04 2D"	= "Egyedi azonosító";
"06 03 55 04 2E"	= "DN-minősítő";
"06 03 55 04 2F"	= "Továbbfejlesztett keresési útmutató";
"06 03 55 04 30"	= "Protokollinformáció";
"06 03 55 04 31"	= "Egyedi név";
"06 03 55 04 32"	= "Egyedi tag";
"06 03 55 04 33"	= "Házazonosító";
"06 03 55 04 34"	= "Támogatott algoritmusok";
"06 03 55 04 35"	= "Különbségi visszavonási lista";
"06 03 55 04 36"	= "Engedély";
"06 03 55 04 3A"	= "Kereszttanúsítvány-pár";

/* X.500 object classes */

"06 02 55 06"		= "X.520 objektumosztály";
"06 03 55 06 00"	= "Felül";
"06 03 55 06 01"	= "Becenév";
"06 03 55 06 02"	= "Ország";
"06 03 55 06 03"	= "Helység";
"06 03 55 06 04"	= "Szervezet";
"06 03 55 06 05"	= "Szervezeti egység";
"06 03 55 06 06"	= "Személy";
"06 03 55 06 07"	= "Szervezeti személy";
"06 03 55 06 08"	= "Szervezeti feladat";
"06 03 55 06 09"	= "Nevek csoportja";
"06 03 55 06 0A"	= "Magánszemély";
"06 03 55 06 0B"	= "Alkalmazásfolyamat";
"06 03 55 06 0C"	= "Alkalmazásentitás";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Eszköz";
"06 03 55 06 0F"	= "Erős hitelesítésű felhasználó";
"06 03 55 06 10"	= "Tanúsítványkiadó központ";
"06 03 55 06 11"	= "Egyedi nevek csoportja";
"06 03 55 06 15"	= "PKI-felhasználó";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "X.500-algoritmus";
"06 03 55 08 01"	= "X.500 titkosítási algoritmus";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "X.509 tanúsítvány-kiterjesztés";
"06 03 55 1D 01"	= "Hatósági kulcsazonosító (régi)";
"06 03 55 1D 02"	= "Elsődleges kulcsattribútumok (régi)";
"06 03 55 1D 03"	= "Tanúsítvány-irányelvek (régi)";
"06 03 55 1D 04"	= "Kulcshasználati korlátozás (régi)";
"06 03 55 1D 05"	= "Szabályzattársítás (régi)";
"06 03 55 1D 06"	= "Alfa-megszorítások";
"06 03 55 1D 07"	= "Alany alternatív neve (régi)";
"06 03 55 1D 08"	= "Kibocsátó alternatív neve (régi)";
"06 03 55 1D 09"	= "Egyén könyvtárattribútumai";
"06 03 55 1D 0A"	= "Alapvető megszorítások (régi 2.5.29.10)";
"06 03 55 1D 0B"	= "Névmegszorítások (régi)";
"06 03 55 1D 0C"	= "Szabályzatmegszorítások (régi)";
"06 03 55 1D 0D"	= "Alapvető megszorítások (régi 2.5.29.13)";
"06 03 55 1D 0E"	= "Alany kulcsazonosítója";
"06 03 55 1D 0F"	= "Kulcshasználat";
"06 03 55 1D 10"	= "Pirvát kulcshasználati periódus";
"06 03 55 1D 11"	= "Alany alternatív neve";
"06 03 55 1D 12"	= "Kibocsátó alternatív neve";
"06 03 55 1D 13"	= "Alapvető megszorítások";
"06 03 55 1D 14"	= "Tanúsítvány-visszavonási listaszám";
"06 03 55 1D 15"	= "CRL ok kód";
"06 03 55 1D 16"	= "Lejárati dátum (régi)";
"06 03 55 1D 17"	= "Tartási utasításkód";
"06 03 55 1D 18"	= "Érvénytelenségi dátum";
"06 03 55 1D 19"	= "CRL elosztási pontok (régi)";
"06 03 55 1D 1A"	= "Kibocsátó elosztási pont (régi)";
"06 03 55 1D 1B"	= "Különbségi CRL indikátor";
"06 03 55 1D 1C"	= "Kibocsátó elosztási pont";
"06 03 55 1D 1D"	= "Tanúsítvány-kibocsátó";
"06 03 55 1D 1E"	= "Névmegszorítások";
"06 03 55 1D 1F"	= "CRL elosztási pontok";
"06 03 55 1D 20"	= "Tanúsítvány-irányelvek";
"06 04 55 1D 20 00"	= "Bármely szabályzatazonosító";
"06 03 55 1D 21"	= "Szabályzattársítások";
"06 03 55 1D 22"	= "Szabályzatmegszorítások";
"06 03 55 1D 23"	= "Hatósági kulcsazonosító";
"06 03 55 1D 24"	= "Szabályzatmegszorítások";
"06 03 55 1D 25"	= "Kiterjesztett kulcshasználat";
"06 04 55 1D 25 00"	= "Bármely kiterjesztett kulcshasználat";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS aláíró algoritmus";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza aláíró algoritmus";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS bizalmassági algoritmus";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza bizalmassági algoritmus";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS integritási algoritmus";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza integritási algoritmus";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS tokenvédelmi algoritmus";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza tokenvédelmi algoritmus";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS kulcskezelő algoritmus";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza kulcskezelő algoritmus";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS kulcskezelő és aláíró algoritmus";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza kulcskezelő és aláíró algoritmus";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A aláíró algoritmus";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A bizalmassági algoritmus";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A integritási algoritmus";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A tokenvédelmi algoritmus";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A kulcskezelő algoritmus";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A kulcskezelő és aláíró algoritmus";
"06 09 60 86 48 01 65 02 01 01 13"	= "Fortezza frissített aláíró algoritmus";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza kulcskezelő és frissített aláíró algoritmus";
"06 09 60 86 48 01 65 02 01 01 15"	= "Fortezza frissített integritási algoritmus";
"06 09 60 86 48 01 65 02 01 01 16"	= "Kulcscserélő algoritmus";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza Wrap80 algoritmus";
"06 09 60 86 48 01 65 02 01 01 18"	= "Kulcstitkosító algoritmus (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822 üzenetformátum";
"06 09 60 86 48 01 65 02 01 02 02"	= "Üres tartalom";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP tartalomtípus";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3 tartalomtípus";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP tartalomtípus";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP Rekey ügynökprotokoll";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1 tartalomtípus";
"06 09 60 86 48 01 65 02 01 02 48"	= "Továbbított MSP üzenettest rész";
"06 09 60 86 48 01 65 02 01 02 49"	= "MSP továbbított üzenetparaméterek";
"06 09 60 86 48 01 65 02 01 02 50"	= "Továbbított CSP üzenettest rész";
"06 09 60 86 48 01 65 02 01 02 51"	= "CSP továbbított üzenetparaméterek";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS biztonsági szabályzat";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Biztonsági szabályzat";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Általános";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Alapértelmezett biztonsági szabályzat";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS kulcskezelő tanúsítvány";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS felhasználói aláírás-tanúsítvány";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS kulcskezelő és aláíró tanúsítvány";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza kulcskezelő tanúsítvány";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza kulcskezelő és aláíró tanúsítvány";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza felhasználói aláírás-tanúsítvány";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza CA aláírás-tanúsítvány";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS CA aláírás-tanúsítvány";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Segédvektor";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Nyugtaszabályzat";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Tagság";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Adminisztrátorok";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS-aláírás CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS-aláírás CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "SDNS tanúsítvány-visszavonási lista";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Fortezza tanúsítvány-visszavonási lista";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Mentesített címfeldolgozó";
"06 09 60 86 48 01 65 02 01 05 30"	= "Guard";
"06 09 60 86 48 01 65 02 01 05 31"	= "Támogatott algoritmusok";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A kulcskezelő tanúsítvány";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A kulcskezelő és aláíró tanúsítvány";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A felhasználói aláírás-tanúsítvány";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC-infó";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC CA-megszorítások";
"06 09 60 86 48 01 65 02 01 05 37"	= "Aláírás- vagy kulcskezelő jogosultságok";
"06 09 60 86 48 01 65 02 01 05 38"	= "Általános jogosultságok";
"06 09 60 86 48 01 65 02 01 05 39"	= "Címkézett attribútum";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Szabályzatinformációs fájl";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Bizt. szabályzatinformációs fájl";
"06 09 60 86 48 01 65 02 01 05 3C"	= "CA engedély-megszorítás";

"06 09 60 86 48 01 65 02 01 07 01"		= "CSP-kiterjesztések";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI biztonsági kategóriák";
"06 09 60 86 48 01 65 02 01 08 02"		= "Szabványos biztonsági címkejogosultságok";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Aláírás-jogosultságok";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Kulcskezelő jogosultságok";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Elnevezett címkekészlet-jogosultságok";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK demó";
"06 09 60 86 48 01 65 02 01 0B 02"			= "USA Védelmi Minisztérium 2-es osztály";
"06 09 60 86 48 01 65 02 01 0B 03"			= "USA közép pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "USA Védelmi Minisztérium 4-es osztály";
"06 09 60 86 48 01 65 02 01 0B 05"			= "USA Védelmi Minisztérium 3-as osztály";
"06 09 60 86 48 01 65 02 01 0B 06"			= "USA Védelmi Minisztérium 5-ös osztály";
"06 09 60 86 48 01 65 02 01 0B 09"			= "USA Védelmi Minisztérium PKI 3-as osztály";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Teszt biztonsági szabályzat";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 címke nullára állítva";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 címke egyre állítva";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 címke kettőre állítva";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2 biztonsági kategóriák";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 címke nullára állítva";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 címke egyre állítva";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 címke kettőre állítva";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka biztonsági kategóriák";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka címkekészletnév 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka címkekészletnév 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka címkekészletnév 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Teszt CRL-bejegyzés";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Címke";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK szabályzatszabályzat";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "FBCA alapvető szabályzatazonosító";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "FBCA alap szabályzatazonosító";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "FBCA közepes szabályzatazonosító";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "FBCA magas szabályzatazonosító";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA-kulcs";
"06 08 60 86 48 01 65 03 02 03"			= "Kiterjesztések";
"06 09 60 86 48 01 65 03 02 03 01"		= "Kulcsvisszaállítási technika";
"06 09 60 86 48 01 65 03 02 03 02"		= "Kulcsvisszaállításra képes";
"06 09 60 86 48 01 65 03 02 03 03"		= "Kulcsvisszaállítás";
"06 08 60 86 48 01 65 03 02 04"			= "Kulcsvisszaállítási sémák";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR GAK kiterjesztés";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST-algoritmus";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell-algoritmus";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 RSA BSAFE1 titkosítással";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 RSA BSAFE1 titkosítással";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 RSA BSAFE1 titkosítással";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM-kivonat";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC SHA1-RSA elemmel";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC MD5-RSA elemmel";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC ISO Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4-csomag";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA BSAFE1 titkosítás";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "NW-jelszó";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "PKI attribútumtípus";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Biztonsági attribútumok";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Bizalmi korlát";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape objektumazonosító";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape tanúsítvány-kiterjesztés";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Netscape tanúsítványtípus";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape alap-URL";
"06 09 60 86 48 01 86 F8 42 01 03"	= "Netscape visszavonási URL";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape CA visszavonási URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape CRL letöltési URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape CA tanúsítvány-letöltési URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape tanúsítvány-megújító URL";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape CA szabályzat-URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "Netscape tanúsítványhonlap-URL";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Netscape tanúsítványentitás-embléma";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Netscape tanúsítvány felhasználói kép";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscape SSL-szervernév";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape tanúsítvány-megjegyzés";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscape adattípus";
"06 09 60 86 48 01 86 F8 42 02 01"	= "kép/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "kép/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "szöveg/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape tanúsítványsorozat";
"06 09 60 86 48 01 86 F8 42 02 06"	= "Netscape tanúsítvány-URL";

"06 08 60 86 48 01 86 F8 42 03"			= "Netscape könyvtárobjektum-azonosító";
"06 09 60 86 48 01 86 F8 42 03 01"		= "LDAP-definíciók";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Autórendszám";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Részleg száma";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Alkalmazotti szám";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Alkalmazotti típus";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Intranet szervezeti személy";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Szerver kapuzott crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Ismeretlen Verisign VPN-kiterjesztés";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Ismeretlen Verisign VPN-kiterjesztés";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign szabályzatazonosító";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1 jegyzet";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Tartalomtípus";
"06 04 67 2A 00 00"	= "PAN-adatok";
"06 04 67 2A 00 01"	= "PAN-token";
"06 04 67 2A 00 02"	= "Csak-PAN";

"06 03 67 2A 01"	= "Üzenet-kiterjesztés";
"06 03 67 2A 02"	= "Mező";
"06 04 67 2A 02 00"	= "Teljes név";
"06 04 67 2A 02 01"	= "Utónév";
"06 04 67 2A 02 02"	= "Családi név";
"06 04 67 2A 02 03"	= "Születési családi név";
"06 04 67 2A 02 04"	= "Helynév";
"06 04 67 2A 02 05"	= "Azonosítószám";
"06 04 67 2A 02 06"	= "Hónap";
"06 04 67 2A 02 07"	= "Dátum";
"06 04 67 2A 02 08"	= "Cím";
"06 04 67 2A 02 09"	= "Telefon";
"06 04 67 2A 02 0A"	= "Mennyiség";
"06 04 67 2A 02 0B"	= "Fiókszám";
"06 04 67 2A 02 0C"	= "Jelmondat";

"06 03 67 2A 03"		= "Attribútum";
"06 04 67 2A 03 00"		= "Tanúsítvány";
"06 05 67 2A 03 00 00"	= "Gyökérkulcs-ujjlenyomat";
"06 05 67 2A 03 00 01"	= "Járulékos szabályzat";

"06 03 67 2A 04"	= "Algoritmus";
"06 03 67 2A 05"	= "Szabályzat";
"06 04 67 2A 05 00"	= "Gyökér";
"06 03 67 2A 06"	= "Modul";
"06 03 67 2A 07"	= "Tanúsítvány-kiterjesztés";
"06 04 67 2A 07 00"	= "Hashelt györkérkulcs";
"06 04 67 2A 07 01"	= "Tanúsítványtípus";
"06 04 67 2A 07 02"	= "Kereskedelmi adatok";
"06 04 67 2A 07 03"	= "Kártyatanúsítvány szükséges";
"06 04 67 2A 07 04"	= "Alagutazás";
"06 04 67 2A 07 05"	= "SET-kiterjesztések";
"06 04 67 2A 07 06"	= "SET-minősítő";

"06 03 67 2A 08"	= "Márka";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Forgalmazó";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Nemzeti";
"06 05 67 2A 0A E2 00"	= "Japán";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Hashelt györkérkulcs";
"06 04 86 8D 6F 03"	= "Tanúsítványtípus";
"06 04 86 8D 6F 04"	= "Kereskedelmi adatok";
"06 04 86 8D 6F 05"	= "Kártyatanúsítvány szükséges";
"06 04 86 8D 6F 06"	= "Alagutazás";
"06 04 86 8D 6F 07"	= "SET-minősítő";
"06 04 86 8D 6F 63"	= "SET-adatok";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Apple adatbiztonság";

"06 08 2A 86 48 86 F7 63 64 01" = "Apple megbízhatósági szabályzatazonosító";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple iSign-szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Apple X.509 alapszabályzat";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Apple SSL-szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Apple helyi tanúsítványgeneráló szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Apple helyi CSR-generáló szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Apple CRL visszavonási szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Apple OCSP-visszavonási szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Apple S/MIME-szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Apple kiterjeszthető hitelesítési szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Apple szoftverfrissítés-aláíró szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple IPsec-szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple iChat-szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Apple erőforrás-aláíró szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Apple Kerberos kliens szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Apple Kerberos szerver szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Apple kódaláíró-szabályzat";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Apple csomagaláíró szabályzat";

"06 08 2A 86 48 86 F7 63 64 02" = "Apple biztonsági algoritmusazonosító";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Gyors elliptikus titkosítás (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Apple biztonságos tömörítés (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE MD5-aláírással";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE SHA-1-aláírással";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED-titkosító";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (kísérleti)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE ECDSA-aláírással";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac tanúsítványazonosító";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac tanúsítványkérés";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac identitás tanúsítványkérés";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac e-mail aláíró tanúsítványkérés";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac e-mail titkosító tanúsítványkérés";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac archívum listázási kérés";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac archívum tárolási kérés";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac archívum ellenőrzési kérés";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac archívum eltávolítási kérés";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac tanúsítvány-kiterjesztés";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac identitás";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac e-mail aláíró";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple .Mac e-mail titkosító";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple .Mac tanúsítványkérési érték";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Felhasználói név";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Jelszó";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Hosztnév";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Megújítási zászló";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Aszinkron megjelölés";

"06 08 2A 86 48 86 F7 63 64 04" = "Apple kibővített kulcshasználat";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Apple kódaláíró";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Apple kódaláíró (fejlesztői)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Apple szoftverfrissítés-aláíró";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Apple kódaláíró (fenntartott)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple erőforrás-aláíró";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple iChat-aláíró";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat-titkosító";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Apple rendszeridentitás";

"06 08 2A 86 48 86 F7 63 64 05" = "Apple tanúsítványi irányelvek";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Apple tanúsítványszabályzat";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac tanúsítványszabályzat";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Kódaláíró";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel CDSA biztonság";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel CDSA biztonsági formátumok";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "X.509v3 tanúsítvány-kiterjesztés";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "X.509v3 privát tanúsítvány-kiterjesztés";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Alany aláíró bittérképe";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Alany képe";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Alany e-mail címe";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Mentesítések használata";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel CDSA biztonsági algoritmus";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 ECDSA-val";

/* end */
